Hi @alexhung,

Even with latest `v11.5.1` the golang virtual repo would be replaced when I add an entry to `external_dependencies_patterns`:

```
  # artifactory_virtual_go_repository.test-tf-go must be replaced
-/+ resource "artifactory_virtual_go_repository" "test-tf-go" {
      ~ external_dependencies_patterns                     = [ # forces replacement
            # (1 unchanged element hidden)
            "**/github.com/**",
          + "**/github.comic/**",
        ]
      ~ id                                                 = "test-tf-go" -> (known after apply)
      ~ package_type                                       = "go" -> (known after apply)
      ~ project_environments                               = [] -> (known after apply)
        # (11 unchanged attributes hidden)
    }
```

Do you have an idea what's going on?

Thanks,
Gregor